src/main/test/supply-chain/5-Smoke Tests/2-Control Tax/0-Finalization/1-TC01.09_Simulate_ApplyTax/6-TC01_02_02.02_Simulate_ApplyTax_8(2)/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:con="http://controlTax.ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <con:controlTax>
         <!--Optional:-->
         <arg0>
            <DocumentId>
               <SystemSourceId>COMPASS001</SystemSourceId>
               <TransactionId>1000154684</TransactionId>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>TEST10_RIX4-N</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10>TEST</CustomField10>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <GrossPriceCalculation>N</GrossPriceCalculation>
            <PriceType>net</PriceType>
            <PreviousInvoiceTaxCountry>GB</PreviousInvoiceTaxCountry>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
                  <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>GB</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>GB</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>DOM</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>GB</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>GB</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>8.00</NetAmount>
                  <TaxAmount>0.56</TaxAmount>
                  <GrossAmount>8.56</GrossAmount>
                  <TaxAmountInLocalCurrency>0.44</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>2</TaxCode>
                     <TaxRate>7.0000</TaxRate>
                     <NetAmount>8.00</NetAmount>
                     <TaxAmount>0.56</TaxAmount>
                     <GrossAmount>8.56</GrossAmount>
                     <TaxAmountInLocalCurrency>0.44</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  <NetAmount>8.00</NetAmount>
                  <TaxAmount>0.56</TaxAmount>
                  <GrossAmount>8.56</GrossAmount>
                  <TaxAmountInLocalCurrency/>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>2</TaxCode>
                     <TaxRate>7.0000</TaxRate>
                     <NetAmount>8.00</NetAmount>
                     <TaxAmount>0.56</TaxAmount>
                     <GrossAmount>8.56</GrossAmount>
                     <TaxAmountInLocalCurrency/>
                  </TaxInvoiceSubTotal>
               </BuyerTaxTotal>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyExchangeRate>0.78116</SellerLocalTaxCurrencyExchangeRate>
                  <SellerLocalTaxCurrencyCode>GBP</SellerLocalTaxCurrencyCode>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>30151672</ItemNo>
                  <ItemType/>
                  <UNSPSC>56000000</UNSPSC>
                  <Classification>M</Classification>
                  <SubClassification>GOODS</SubClassification>
                  <NetAmount>8.00</NetAmount>
                  <SellerTax>
                     <SellerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>0.56</TaxAmount>
                           <ItemTaxAmount/>
                           <GrossAmount>8.56</GrossAmount>
                           <ItemGrossAmount/>
                           <NetAmount>8.00</NetAmount>
                           <ItemNetAmount/>
                           <TaxAmountInLocalCurrency>0.44</TaxAmountInLocalCurrency>
                           <ItemTaxAmountInLocalCurrency/>
                           <TaxCode>2</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>7.0000</TaxRate>
                           <CalculationRule>RateOnNet</CalculationRule>
                        </TaxCalculationLineComponent>
                     </SellerTaxCountry>
                  </SellerTax>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>0.56</TaxAmount>
                           <ItemTaxAmount/>
                           <GrossAmount>8.56</GrossAmount>
                           <ItemGrossAmount/>
                           <NetAmount>8.00</NetAmount>
                           <ItemNetAmount/>
                           <TaxAmountInLocalCurrency/>
                           <ItemTaxAmountInLocalCurrency/>
                           <TaxCode>2</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>7.0000</TaxRate>
                           <CalculationRule>RateOnNet</CalculationRule>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>GB</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>GB894 4222 05</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>GB</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>GB527 7733 20</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
			   <TaxAlgorithmDate>2015-07-02</TaxAlgorithmDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>GB</ConsignorCountry>
               <ConsignorBusinessUnitCode>320</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>DT</ConsignorBusinessUnitType>
               <ConsigneeCountry>GB</ConsigneeCountry>
               <ConsigneeState>GBCRY</ConsigneeState>
               <ConsigneeBusinessUnitCode>144</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
               <ShipmentStartCountry>GB</ShipmentStartCountry>
               <ShipmentEndCountry>GB</ShipmentEndCountry>
               <ShipmentEndState>GBCRY</ShipmentEndState>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>1840</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>M</AddressType>
                     <City>LONDON</City>
                     <Street>255 North Circular Road</Street>
                     <ZipCode>NW10 0JQ</ZipCode>
                     <CountryCode>GB</CountryCode>
                     <CountryOfLegalRegistration>GB</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>M</AddressType>
                     <City>Pratteln</City>
                     <Street>Grössenweg 15</Street>
                     <ZipCode>4133</ZipCode>
                     <CountryCode>CH</CountryCode>
                     <CountryOfLegalRegistration>CH</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery/>
         </arg0>
      </con:controlTax>
   </soap:Body>
</soap:Envelope>